export const ADDRESS_BLOCK_PATTERN =
  '(?:' +
  '[0-9０-９一二三四五六七八九十百千〇零]{1,3}丁目\s*' +
  '[0-9０-９一二三四五六七八九十百千〇零]{1,3}番\s*' +
  '[0-9０-９一二三四五六七八九十百千〇零]{1,3}号?' +
  '|' +
  '[0-9０-９一二三四五六七八九十百千〇零]{1,3}丁目\s*' +
  '[0-9０-９一二三四五六七八九十百千〇零]{1,3}(?:番|号)' +
  '|' +
  '[0-9０-９一二三四五六七八九十百千〇零]{1,3}丁目' +
  '|' +
  '[東西南北]?[0-9０-９一二三四五六七八九十百千〇零]{1,3}条' +
  '[東西南北]?[0-9０-９一二三四五六七八九十百千〇零]{1,3}丁目?' +
  '|' +
  '[0-9０-９一二三四五六七八九十百千〇零]{1,3}' +
  '(?:[-‐ー－]|の)' +
  '[0-9０-９一二三四五六七八九十百千〇零]{1,3}' +
  '(?:(?:[-‐ー－]|の)[0-9０-９一二三四五六七八九十百千〇零]{1,3})?' +
  ')(?![0-9０-９])';
